GopalSaraf/Practicals/PSDL/include/proc/pic18lf47k42.inc
// Register: CRCDATA
#define CRCDATA CRCDATA
CRCDATA                                  equ 03960h

// Register: CRCDATL
#define CRCDATL CRCDATL
CRCDATL                                  equ 03960h
// bitfield definitions
CRCDATL_DATA0_POSN                       equ 0000h
CRCDATL_DATA0_POSITION                   equ 0000h
CRCDATL_DATA0_SIZE                       equ 0001h
CRCDATL_DATA0_LENGTH                     equ 0001h
CRCDATL_DATA0_MASK                       equ 0001h
CRCDATL_DATA1_POSN                       equ 0001h
CRCDATL_DATA1_POSITION                   equ 0001h
CRCDATL_DATA1_SIZE                       equ 0001h
CRCDATL_DATA1_LENGTH                     equ 0001h
CRCDATL_DATA1_MASK                       equ 0002h
CRCDATL_DATA2_POSN                       equ 0002h
CRCDATL_DATA2_POSITION                   equ 0002h
CRCDATL_DATA2_SIZE                       equ 0001h
CRCDATL_DATA2_LENGTH                     equ 0001h
CRCDATL_DATA2_MASK                       equ 0004h
CRCDATL_DATA3_POSN                       equ 0003h
CRCDATL_DATA3_POSITION                   equ 0003h
CRCDATL_DATA3_SIZE                       equ 0001h
CRCDATL_DATA3_LENGTH                     equ 0001h
CRCDATL_DATA3_MASK                       equ 0008h
CRCDATL_DATA4_POSN                       equ 0004h
CRCDATL_DATA4_POSITION                   equ 0004h
CRCDATL_DATA4_SIZE                       equ 0001h
CRCDATL_DATA4_LENGTH                     equ 0001h
CRCDATL_DATA4_MASK                       equ 0010h
CRCDATL_DATA5_POSN                       equ 0005h
CRCDATL_DATA5_POSITION                   equ 0005h
CRCDATL_DATA5_SIZE                       equ 0001h
CRCDATL_DATA5_LENGTH                     equ 0001h
CRCDATL_DATA5_MASK                       equ 0020h
CRCDATL_DATA6_POSN                       equ 0006h
CRCDATL_DATA6_POSITION                   equ 0006h
CRCDATL_DATA6_SIZE                       equ 0001h
CRCDATL_DATA6_LENGTH                     equ 0001h
CRCDATL_DATA6_MASK                       equ 0040h
CRCDATL_DATA7_POSN                       equ 0007h
CRCDATL_DATA7_POSITION                   equ 0007h
CRCDATL_DATA7_SIZE                       equ 0001h
CRCDATL_DATA7_LENGTH                     equ 0001h
CRCDATL_DATA7_MASK                       equ 0080h

// Register: CRCDATH
#define CRCDATH CRCDATH
CRCDATH                                  equ 03961h
// bitfield definitions
CRCDATH_DATA8_POSN                       equ 0000h
CRCDATH_DATA8_POSITION                   equ 0000h
CRCDATH_DATA8_SIZE                       equ 0001h
CRCDATH_DATA8_LENGTH                     equ 0001h
CRCDATH_DATA8_MASK                       equ 0001h
CRCDATH_DATA9_POSN                       equ 0001h
CRCDATH_DATA9_POSITION                   equ 0001h
CRCDATH_DATA9_SIZE                       equ 0001h
CRCDATH_DATA9_LENGTH                     equ 0001h
CRCDATH_DATA9_MASK                       equ 0002h
CRCDATH_DATA10_POSN                      equ 0002h
CRCDATH_DATA10_POSITION                  equ 0002h
CRCDATH_DATA10_SIZE                      equ 0001h
CRCDATH_DATA10_LENGTH                    equ 0001h
CRCDATH_DATA10_MASK                      equ 0004h
CRCDATH_DATA11_POSN                      equ 0003h
CRCDATH_DATA11_POSITION                  equ 0003h
CRCDATH_DATA11_SIZE                      equ 0001h
CRCDATH_DATA11_LENGTH                    equ 0001h
CRCDATH_DATA11_MASK                      equ 0008h
CRCDATH_DATA12_POSN                      equ 0004h
CRCDATH_DATA12_POSITION                  equ 0004h
CRCDATH_DATA12_SIZE                      equ 0001h
CRCDATH_DATA12_LENGTH                    equ 0001h
CRCDATH_DATA12_MASK                      equ 0010h
CRCDATH_DATA13_POSN                      equ 0005h
CRCDATH_DATA13_POSITION                  equ 0005h
CRCDATH_DATA13_SIZE                      equ 0001h
CRCDATH_DATA13_LENGTH                    equ 0001h
CRCDATH_DATA13_MASK                      equ 0020h
CRCDATH_DATA14_POSN                      equ 0006h
CRCDATH_DATA14_POSITION                  equ 0006h
CRCDATH_DATA14_SIZE                      equ 0001h
CRCDATH_DATA14_LENGTH                    equ 0001h
CRCDATH_DATA14_MASK                      equ 0040h
CRCDATH_DATA15_POSN                      equ 0007h
CRCDATH_DATA15_POSITION                  equ 0007h
CRCDATH_DATA15_SIZE                      equ 0001h
CRCDATH_DATA15_LENGTH                    equ 0001h
CRCDATH_DATA15_MASK                      equ 0080h

// Register: CRCACC
#define CRCACC CRCACC
CRCACC                                   equ 03962h

// Register: CRCACCL
#define CRCACCL CRCACCL
CRCACCL                                  equ 03962h
// bitfield definitions
CRCACCL_ACC0_POSN                        equ 0000h
CRCACCL_ACC0_POSITION                    equ 0000h
CRCACCL_ACC0_SIZE                        equ 0001h
CRCACCL_ACC0_LENGTH                      equ 0001h
CRCACCL_ACC0_MASK                        equ 0001h
CRCACCL_ACC1_POSN                        equ 0001h
CRCACCL_ACC1_POSITION                    equ 0001h
CRCACCL_ACC1_SIZE                        equ 0001h
CRCACCL_ACC1_LENGTH                      equ 0001h
CRCACCL_ACC1_MASK                        equ 0002h
CRCACCL_ACC2_POSN                        equ 0002h
CRCACCL_ACC2_POSITION                    equ 0002h
CRCACCL_ACC2_SIZE                        equ 0001h
CRCACCL_ACC2_LENGTH                      equ 0001h
CRCACCL_ACC2_MASK                        equ 0004h
CRCACCL_ACC3_POSN                        equ 0003h
CRCACCL_ACC3_POSITION                    equ 0003h
CRCACCL_ACC3_SIZE                        equ 0001h
CRCACCL_ACC3_LENGTH                      equ 0001h
CRCACCL_ACC3_MASK                        equ 0008h
CRCACCL_ACC4_POSN                        equ 0004h
CRCACCL_ACC4_POSITION                    equ 0004h
CRCACCL_ACC4_SIZE                        equ 0001h
CRCACCL_ACC4_LENGTH                      equ 0001h
CRCACCL_ACC4_MASK                        equ 0010h
CRCACCL_ACC5_POSN                        equ 0005h
CRCACCL_ACC5_POSITION                    equ 0005h
CRCACCL_ACC5_SIZE                        equ 0001h
CRCACCL_ACC5_LENGTH                      equ 0001h
CRCACCL_ACC5_MASK                        equ 0020h
CRCACCL_ACC6_POSN                        equ 0006h
CRCACCL_ACC6_POSITION                    equ 0006h
CRCACCL_ACC6_SIZE                        equ 0001h
CRCACCL_ACC6_LENGTH                      equ 0001h
CRCACCL_ACC6_MASK                        equ 0040h
CRCACCL_ACC7_POSN                        equ 0007h
CRCACCL_ACC7_POSITION                    equ 0007h
CRCACCL_ACC7_SIZE                        equ 0001h
CRCACCL_ACC7_LENGTH                      equ 0001h
CRCACCL_ACC7_MASK                        equ 0080h

// Register: CRCACCH
#define CRCACCH CRCACCH
CRCACCH                                  equ 03963h
// bitfield definitions
CRCACCH_ACC8_POSN                        equ 0000h
CRCACCH_ACC8_POSITION                    equ 0000h
CRCACCH_ACC8_SIZE                        equ 0001h
CRCACCH_ACC8_LENGTH                      equ 0001h
CRCACCH_ACC8_MASK                        equ 0001h
CRCACCH_ACC9_POSN                        equ 0001h
CRCACCH_ACC9_POSITION                    equ 0001h
CRCACCH_ACC9_SIZE                        equ 0001h
CRCACCH_ACC9_LENGTH                      equ 0001h
CRCACCH_ACC9_MASK                        equ 0002h
CRCACCH_ACC10_POSN                       equ 0002h
CRCACCH_ACC10_POSITION                   equ 0002h
CRCACCH_ACC10_SIZE                       equ 0001h
CRCACCH_ACC10_LENGTH                     equ 0001h
CRCACCH_ACC10_MASK                       equ 0004h
CRCACCH_ACC11_POSN                       equ 0003h
CRCACCH_ACC11_POSITION                   equ 0003h
CRCACCH_ACC11_SIZE                       equ 0001h
CRCACCH_ACC11_LENGTH                     equ 0001h
CRCACCH_ACC11_MASK                       equ 0008h
CRCACCH_ACC12_POSN                       equ 0004h
CRCACCH_ACC12_POSITION                   equ 0004h
CRCACCH_ACC12_SIZE                       equ 0001h
CRCACCH_ACC12_LENGTH                     equ 0001h
CRCACCH_ACC12_MASK                       equ 0010h
CRCACCH_ACC13_POSN                       equ 0005h
CRCACCH_ACC13_POSITION                   equ 0005h
CRCACCH_ACC13_SIZE                       equ 0001h
CRCACCH_ACC13_LENGTH                     equ 0001h
CRCACCH_ACC13_MASK                       equ 0020h
CRCACCH_ACC14_POSN                       equ 0006h
CRCACCH_ACC14_POSITION                   equ 0006h
CRCACCH_ACC14_SIZE                       equ 0001h
CRCACCH_ACC14_LENGTH                     equ 0001h
CRCACCH_ACC14_MASK                       equ 0040h
CRCACCH_ACC15_POSN                       equ 0007h
CRCACCH_ACC15_POSITION                   equ 0007h
CRCACCH_ACC15_SIZE                       equ 0001h
CRCACCH_ACC15_LENGTH                     equ 0001h
CRCACCH_ACC15_MASK                       equ 0080h

// Register: CRCSHFT
#define CRCSHFT CRCSHFT
CRCSHFT                                  equ 03964h

// Register: CRCSHIFTL
#define CRCSHIFTL CRCSHIFTL
CRCSHIFTL                                equ 03964h
// bitfield definitions
CRCSHIFTL_SHFT0_POSN                     equ 0000h
CRCSHIFTL_SHFT0_POSITION                 equ 0000h
CRCSHIFTL_SHFT0_SIZE                     equ 0001h
CRCSHIFTL_SHFT0_LENGTH                   equ 0001h
CRCSHIFTL_SHFT0_MASK                     equ 0001h
CRCSHIFTL_SHFT1_POSN                     equ 0001h
CRCSHIFTL_SHFT1_POSITION                 equ 0001h
CRCSHIFTL_SHFT1_SIZE                     equ 0001h
CRCSHIFTL_SHFT1_LENGTH                   equ 0001h
CRCSHIFTL_SHFT1_MASK                     equ 0002h
CRCSHIFTL_SHFT2_POSN                     equ 0002h
CRCSHIFTL_SHFT2_POSITION                 equ 0002h
CRCSHIFTL_SHFT2_SIZE                     equ 0001h
CRCSHIFTL_SHFT2_LENGTH                   equ 0001h
CRCSHIFTL_SHFT2_MASK                     equ 0004h
CRCSHIFTL_SHFT3_POSN                     equ 0003h
CRCSHIFTL_SHFT3_POSITION                 equ 0003h
CRCSHIFTL_SHFT3_SIZE                     equ 0001h
CRCSHIFTL_SHFT3_LENGTH                   equ 0001h
CRCSHIFTL_SHFT3_MASK                     equ 0008h
CRCSHIFTL_SHFT4_POSN                     equ 0004h
CRCSHIFTL_SHFT4_POSITION                 equ 0004h
CRCSHIFTL_SHFT4_SIZE                     equ 0001h
CRCSHIFTL_SHFT4_LENGTH                   equ 0001h
CRCSHIFTL_SHFT4_MASK                     equ 0010h
CRCSHIFTL_SHFT5_POSN                     equ 0005h
CRCSHIFTL_SHFT5_POSITION                 equ 0005h
CRCSHIFTL_SHFT5_SIZE                     equ 0001h
CRCSHIFTL_SHFT5_LENGTH                   equ 0001h
CRCSHIFTL_SHFT5_MASK                     equ 0020h
CRCSHIFTL_SHFT6_POSN                     equ 0006h
CRCSHIFTL_SHFT6_POSITION                 equ 0006h
CRCSHIFTL_SHFT6_SIZE                     equ 0001h
CRCSHIFTL_SHFT6_LENGTH                   equ 0001h
CRCSHIFTL_SHFT6_MASK                     equ 0040h
CRCSHIFTL_SHFT7_POSN                     equ 0007h
CRCSHIFTL_SHFT7_POSITION                 equ 0007h
CRCSHIFTL_SHFT7_SIZE                     equ 0001h
CRCSHIFTL_SHFT7_LENGTH                   equ 0001h
CRCSHIFTL_SHFT7_MASK                     equ 0080h

