GopalSaraf/Practicals/PSDL/include/proc/pic18lf47k42.inc
// Register: RD0I2C
#define RD0I2C RD0I2C
RD0I2C                                   equ 03A7Ah
// bitfield definitions
RD0I2C_TH_POSN                           equ 0000h
RD0I2C_TH_POSITION                       equ 0000h
RD0I2C_TH_SIZE                           equ 0002h
RD0I2C_TH_LENGTH                         equ 0002h
RD0I2C_TH_MASK                           equ 0003h
RD0I2C_PU_POSN                           equ 0004h
RD0I2C_PU_POSITION                       equ 0004h
RD0I2C_PU_SIZE                           equ 0002h
RD0I2C_PU_LENGTH                         equ 0002h
RD0I2C_PU_MASK                           equ 0030h
RD0I2C_SLEW_POSN                         equ 0006h
RD0I2C_SLEW_POSITION                     equ 0006h
RD0I2C_SLEW_SIZE                         equ 0001h
RD0I2C_SLEW_LENGTH                       equ 0001h
RD0I2C_SLEW_MASK                         equ 0040h
RD0I2C_TH0_POSN                          equ 0000h
RD0I2C_TH0_POSITION                      equ 0000h
RD0I2C_TH0_SIZE                          equ 0001h
RD0I2C_TH0_LENGTH                        equ 0001h
RD0I2C_TH0_MASK                          equ 0001h
RD0I2C_TH1_POSN                          equ 0001h
RD0I2C_TH1_POSITION                      equ 0001h
RD0I2C_TH1_SIZE                          equ 0001h
RD0I2C_TH1_LENGTH                        equ 0001h
RD0I2C_TH1_MASK                          equ 0002h
RD0I2C_PU0_POSN                          equ 0004h
RD0I2C_PU0_POSITION                      equ 0004h
RD0I2C_PU0_SIZE                          equ 0001h
RD0I2C_PU0_LENGTH                        equ 0001h
RD0I2C_PU0_MASK                          equ 0010h
RD0I2C_PU1_POSN                          equ 0005h
RD0I2C_PU1_POSITION                      equ 0005h
RD0I2C_PU1_SIZE                          equ 0001h
RD0I2C_PU1_LENGTH                        equ 0001h
RD0I2C_PU1_MASK                          equ 0020h
RD0I2C_I2CTH_POSN                        equ 0000h
RD0I2C_I2CTH_POSITION                    equ 0000h
RD0I2C_I2CTH_SIZE                        equ 0002h
RD0I2C_I2CTH_LENGTH                      equ 0002h
RD0I2C_I2CTH_MASK                        equ 0003h
RD0I2C_I2CPU_POSN                        equ 0004h
RD0I2C_I2CPU_POSITION                    equ 0004h
RD0I2C_I2CPU_SIZE                        equ 0002h
RD0I2C_I2CPU_LENGTH                      equ 0002h
RD0I2C_I2CPU_MASK                        equ 0030h
RD0I2C_I2CSLEW_POSN                      equ 0006h
RD0I2C_I2CSLEW_POSITION                  equ 0006h
RD0I2C_I2CSLEW_SIZE                      equ 0001h
RD0I2C_I2CSLEW_LENGTH                    equ 0001h
RD0I2C_I2CSLEW_MASK                      equ 0040h
RD0I2C_I2CTH0_POSN                       equ 0000h
RD0I2C_I2CTH0_POSITION                   equ 0000h
RD0I2C_I2CTH0_SIZE                       equ 0001h
RD0I2C_I2CTH0_LENGTH                     equ 0001h
RD0I2C_I2CTH0_MASK                       equ 0001h
RD0I2C_I2CTH1_POSN                       equ 0001h
RD0I2C_I2CTH1_POSITION                   equ 0001h
RD0I2C_I2CTH1_SIZE                       equ 0001h
RD0I2C_I2CTH1_LENGTH                     equ 0001h
RD0I2C_I2CTH1_MASK                       equ 0002h
RD0I2C_I2CPU0_POSN                       equ 0004h
RD0I2C_I2CPU0_POSITION                   equ 0004h
RD0I2C_I2CPU0_SIZE                       equ 0001h
RD0I2C_I2CPU0_LENGTH                     equ 0001h
RD0I2C_I2CPU0_MASK                       equ 0010h
RD0I2C_I2CPU1_POSN                       equ 0005h
RD0I2C_I2CPU1_POSITION                   equ 0005h
RD0I2C_I2CPU1_SIZE                       equ 0001h
RD0I2C_I2CPU1_LENGTH                     equ 0001h
RD0I2C_I2CPU1_MASK                       equ 0020h

// Register: RD1I2C
#define RD1I2C RD1I2C
RD1I2C                                   equ 03A7Bh
// bitfield definitions
RD1I2C_TH_POSN                           equ 0000h
RD1I2C_TH_POSITION                       equ 0000h
RD1I2C_TH_SIZE                           equ 0002h
RD1I2C_TH_LENGTH                         equ 0002h
RD1I2C_TH_MASK                           equ 0003h
RD1I2C_PU_POSN                           equ 0004h
RD1I2C_PU_POSITION                       equ 0004h
RD1I2C_PU_SIZE                           equ 0002h
RD1I2C_PU_LENGTH                         equ 0002h
RD1I2C_PU_MASK                           equ 0030h
RD1I2C_SLEW_POSN                         equ 0006h
RD1I2C_SLEW_POSITION                     equ 0006h
RD1I2C_SLEW_SIZE                         equ 0001h
RD1I2C_SLEW_LENGTH                       equ 0001h
RD1I2C_SLEW_MASK                         equ 0040h
RD1I2C_TH0_POSN                          equ 0000h
RD1I2C_TH0_POSITION                      equ 0000h
RD1I2C_TH0_SIZE                          equ 0001h
RD1I2C_TH0_LENGTH                        equ 0001h
RD1I2C_TH0_MASK                          equ 0001h
RD1I2C_TH1_POSN                          equ 0001h
RD1I2C_TH1_POSITION                      equ 0001h
RD1I2C_TH1_SIZE                          equ 0001h
RD1I2C_TH1_LENGTH                        equ 0001h
RD1I2C_TH1_MASK                          equ 0002h
RD1I2C_PU0_POSN                          equ 0004h
RD1I2C_PU0_POSITION                      equ 0004h
RD1I2C_PU0_SIZE                          equ 0001h
RD1I2C_PU0_LENGTH                        equ 0001h
RD1I2C_PU0_MASK                          equ 0010h
RD1I2C_PU1_POSN                          equ 0005h
RD1I2C_PU1_POSITION                      equ 0005h
RD1I2C_PU1_SIZE                          equ 0001h
RD1I2C_PU1_LENGTH                        equ 0001h
RD1I2C_PU1_MASK                          equ 0020h
RD1I2C_I2CTH_POSN                        equ 0000h
RD1I2C_I2CTH_POSITION                    equ 0000h
RD1I2C_I2CTH_SIZE                        equ 0002h
RD1I2C_I2CTH_LENGTH                      equ 0002h
RD1I2C_I2CTH_MASK                        equ 0003h
RD1I2C_I2CPU_POSN                        equ 0004h
RD1I2C_I2CPU_POSITION                    equ 0004h
RD1I2C_I2CPU_SIZE                        equ 0002h
RD1I2C_I2CPU_LENGTH                      equ 0002h
RD1I2C_I2CPU_MASK                        equ 0030h
RD1I2C_I2CSLEW_POSN                      equ 0006h
RD1I2C_I2CSLEW_POSITION                  equ 0006h
RD1I2C_I2CSLEW_SIZE                      equ 0001h
RD1I2C_I2CSLEW_LENGTH                    equ 0001h
RD1I2C_I2CSLEW_MASK                      equ 0040h
RD1I2C_I2CTH0_POSN                       equ 0000h
RD1I2C_I2CTH0_POSITION                   equ 0000h
RD1I2C_I2CTH0_SIZE                       equ 0001h
RD1I2C_I2CTH0_LENGTH                     equ 0001h
RD1I2C_I2CTH0_MASK                       equ 0001h
RD1I2C_I2CTH1_POSN                       equ 0001h
RD1I2C_I2CTH1_POSITION                   equ 0001h
RD1I2C_I2CTH1_SIZE                       equ 0001h
RD1I2C_I2CTH1_LENGTH                     equ 0001h
RD1I2C_I2CTH1_MASK                       equ 0002h
RD1I2C_I2CPU0_POSN                       equ 0004h
RD1I2C_I2CPU0_POSITION                   equ 0004h
RD1I2C_I2CPU0_SIZE                       equ 0001h
RD1I2C_I2CPU0_LENGTH                     equ 0001h
RD1I2C_I2CPU0_MASK                       equ 0010h
RD1I2C_I2CPU1_POSN                       equ 0005h
RD1I2C_I2CPU1_POSITION                   equ 0005h
RD1I2C_I2CPU1_SIZE                       equ 0001h
RD1I2C_I2CPU1_LENGTH                     equ 0001h
RD1I2C_I2CPU1_MASK                       equ 0020h

