GopalSaraf/Practicals/PSDL/include/proc/pic18lf47k42.inc
#define LC4G4D1N                         BANKMASK(CLC4GLS3), 0, b
#define LC4G4D1T                         BANKMASK(CLC4GLS3), 1, b
#define LC4G4D2N                         BANKMASK(CLC4GLS3), 2, b
#define LC4G4D2T                         BANKMASK(CLC4GLS3), 3, b
#define LC4G4D3N                         BANKMASK(CLC4GLS3), 4, b
#define LC4G4D3T                         BANKMASK(CLC4GLS3), 5, b
#define LC4G4D4N                         BANKMASK(CLC4GLS3), 6, b
#define LC4G4D4T                         BANKMASK(CLC4GLS3), 7, b
#define LC4G4POL                         BANKMASK(CLC4POL), 3, b
#define LC4INTN                          BANKMASK(CLC4CON), 3, b
#define LC4INTP                          BANKMASK(CLC4CON), 4, b
#define LC4MODE0                         BANKMASK(CLC4CON), 0, b
#define LC4MODE1                         BANKMASK(CLC4CON), 1, b
#define LC4MODE2                         BANKMASK(CLC4CON), 2, b
#define LC4OE                            BANKMASK(CLC4CON), 6, b
#define LC4OUT                           BANKMASK(CLC4CON), 5, b
#define LC4POL                           BANKMASK(CLC4POL), 7, b
#define LC5                              BANKMASK(LATC), 5, a
#define LC6                              BANKMASK(LATC), 6, a
#define LC7                              BANKMASK(LATC), 7, a
#define LD0                              BANKMASK(LATD), 0, a
#define LD1                              BANKMASK(LATD), 1, a
#define LD2                              BANKMASK(LATD), 2, a
#define LD3                              BANKMASK(LATD), 3, a
#define LD4                              BANKMASK(LATD), 4, a
#define LD5                              BANKMASK(LATD), 5, a
#define LD6                              BANKMASK(LATD), 6, a
#define LD7                              BANKMASK(LATD), 7, a
#define LE0                              BANKMASK(LATE), 0, a
#define LE1                              BANKMASK(LATE), 1, a
#define LE2                              BANKMASK(LATE), 2, a
#define LFOEN                            BANKMASK(OSCEN), 4, b
#define LFOR                             BANKMASK(OSCSTAT), 4, b
#define LSBF                             BANKMASK(SPI1CON0), 2, b
#define LTH0                             BANKMASK(ADLTHL), 0, b
#define LTH1                             BANKMASK(ADLTHL), 1, b
#define LTH10                            BANKMASK(ADLTHH), 2, b
#define LTH11                            BANKMASK(ADLTHH), 3, b
#define LTH12                            BANKMASK(ADLTHH), 4, b
#define LTH13                            BANKMASK(ADLTHH), 5, b
#define LTH14                            BANKMASK(ADLTHH), 6, b
#define LTH15                            BANKMASK(ADLTHH), 7, b
#define LTH2                             BANKMASK(ADLTHL), 2, b
#define LTH3                             BANKMASK(ADLTHL), 3, b
#define LTH4                             BANKMASK(ADLTHL), 4, b
#define LTH5                             BANKMASK(ADLTHL), 5, b
#define LTH6                             BANKMASK(ADLTHL), 6, b
#define LTH7                             BANKMASK(ADLTHL), 7, b
#define LTH8                             BANKMASK(ADLTHH), 0, b
#define LTH9                             BANKMASK(ADLTHH), 1, b
#define LTHR                             BANKMASK(ADSTAT), 5, b
#define MAINPR0                          BANKMASK(MAINPR), 0, b
#define MAINPR1                          BANKMASK(MAINPR), 1, b
#define MAINPR2                          BANKMASK(MAINPR), 2, b
#define MATH                             BANKMASK(ADSTAT), 4, b
#define MD0                              BANKMASK(ADCON2), 0, b
#define MD1                              BANKMASK(ADCON2), 1, b
#define MD16                             BANKMASK(T0CON0), 4, a
#define MD1BIT                           BANKMASK(MD1CON0), 0, b
#define MD1CH0                           BANKMASK(MD1CARH), 0, b
#define MD1CH1                           BANKMASK(MD1CARH), 1, b
#define MD1CH2                           BANKMASK(MD1CARH), 2, b
#define MD1CH3                           BANKMASK(MD1CARH), 3, b
#define MD1CH4                           BANKMASK(MD1CARH), 4, b
#define MD1CHPOL                         BANKMASK(MD1CON1), 5, b
#define MD1CHSYNC                        BANKMASK(MD1CON1), 4, b
#define MD1CL0                           BANKMASK(MD1CARL), 0, b
#define MD1CL1                           BANKMASK(MD1CARL), 1, b
#define MD1CL2                           BANKMASK(MD1CARL), 2, b
#define MD1CL3                           BANKMASK(MD1CARL), 3, b
#define MD1CL4                           BANKMASK(MD1CARL), 4, b
#define MD1CLPOL                         BANKMASK(MD1CON1), 1, b
#define MD1CLSYNC                        BANKMASK(MD1CON1), 0, b
#define MD1EN                            BANKMASK(MD1CON0), 7, b
#define MD1MS0                           BANKMASK(MD1SRC), 0, b
#define MD1MS1                           BANKMASK(MD1SRC), 1, b
#define MD1MS2                           BANKMASK(MD1SRC), 2, b
#define MD1MS3                           BANKMASK(MD1SRC), 3, b
#define MD1MS4                           BANKMASK(MD1SRC), 4, b
#define MD1OPOL                          BANKMASK(MD1CON0), 4, b
#define MD1OUT                           BANKMASK(MD1CON0), 5, b
#define MD2                              BANKMASK(ADCON2), 2, b
#define MEMV                             BANKMASK(PCON1), 1, a
#define MFOEN                            BANKMASK(OSCEN), 5, b
#define MFOR                             BANKMASK(OSCSTAT), 5, b
#define MREG                             BANKMASK(SCANCON0), 2, b
#define MS0                              BANKMASK(MD1SRC), 0, b
#define MS1                              BANKMASK(MD1SRC), 1, b
#define MS2                              BANKMASK(MD1SRC), 2, b
#define MS3                              BANKMASK(MD1SRC), 3, b
#define MS4                              BANKMASK(MD1SRC), 4, b
#define MST                              BANKMASK(SPI1CON0), 1, b
#define NACK1IE                          BANKMASK(I2C1ERR), 0, b
#define NACK1IF                          BANKMASK(I2C1ERR), 4, b
#define NACK2IE                          BANKMASK(I2C2ERR), 0, b
#define NACK2IF                          BANKMASK(I2C2ERR), 4, b
#define NCO1ACC0                         BANKMASK(NCO1ACCL), 0, b
#define NCO1ACC1                         BANKMASK(NCO1ACCL), 1, b
#define NCO1ACC10                        BANKMASK(NCO1ACCH), 2, b
#define NCO1ACC11                        BANKMASK(NCO1ACCH), 3, b
#define NCO1ACC12                        BANKMASK(NCO1ACCH), 4, b
#define NCO1ACC13                        BANKMASK(NCO1ACCH), 5, b
#define NCO1ACC14                        BANKMASK(NCO1ACCH), 6, b
#define NCO1ACC15                        BANKMASK(NCO1ACCH), 7, b
#define NCO1ACC16                        BANKMASK(NCO1ACCU), 0, b
#define NCO1ACC17                        BANKMASK(NCO1ACCU), 1, b
#define NCO1ACC18                        BANKMASK(NCO1ACCU), 2, b
#define NCO1ACC19                        BANKMASK(NCO1ACCU), 3, b
#define NCO1ACC2                         BANKMASK(NCO1ACCL), 2, b
#define NCO1ACC3                         BANKMASK(NCO1ACCL), 3, b
#define NCO1ACC4                         BANKMASK(NCO1ACCL), 4, b
#define NCO1ACC5                         BANKMASK(NCO1ACCL), 5, b
#define NCO1ACC6                         BANKMASK(NCO1ACCL), 6, b
#define NCO1ACC7                         BANKMASK(NCO1ACCL), 7, b
#define NCO1ACC8                         BANKMASK(NCO1ACCH), 0, b
#define NCO1ACC9                         BANKMASK(NCO1ACCH), 1, b
#define NCO1CKS0                         BANKMASK(NCO1CLK), 0, b
#define NCO1CKS1                         BANKMASK(NCO1CLK), 1, b
#define NCO1CKS2                         BANKMASK(NCO1CLK), 2, b
#define NCO1CKS3                         BANKMASK(NCO1CLK), 3, b
#define NCO1EN                           BANKMASK(NCO1CON), 7, b
#define NCO1IE                           BANKMASK(PIE4), 5, b
#define NCO1IF                           BANKMASK(PIR4), 5, b
#define NCO1INC0                         BANKMASK(NCO1INCL), 0, b
#define NCO1INC1                         BANKMASK(NCO1INCL), 1, b
#define NCO1INC10                        BANKMASK(NCO1INCH), 2, b
#define NCO1INC11                        BANKMASK(NCO1INCH), 3, b
#define NCO1INC12                        BANKMASK(NCO1INCH), 4, b
#define NCO1INC13                        BANKMASK(NCO1INCH), 5, b
#define NCO1INC14                        BANKMASK(NCO1INCH), 6, b
#define NCO1INC15                        BANKMASK(NCO1INCH), 7, b
#define NCO1INC16                        BANKMASK(NCO1INCU), 0, b
#define NCO1INC17                        BANKMASK(NCO1INCU), 1, b
#define NCO1INC18                        BANKMASK(NCO1INCU), 2, b
#define NCO1INC19                        BANKMASK(NCO1INCU), 3, b
#define NCO1INC2                         BANKMASK(NCO1INCL), 2, b
#define NCO1INC3                         BANKMASK(NCO1INCL), 3, b
#define NCO1INC4                         BANKMASK(NCO1INCL), 4, b
#define NCO1INC5                         BANKMASK(NCO1INCL), 5, b
#define NCO1INC6                         BANKMASK(NCO1INCL), 6, b
#define NCO1INC7                         BANKMASK(NCO1INCL), 7, b
#define NCO1INC8                         BANKMASK(NCO1INCH), 0, b
#define NCO1INC9                         BANKMASK(NCO1INCH), 1, b
#define NCO1IP                           BANKMASK(IPR4), 5, b
#define NCO1MD                           BANKMASK(PMD1), 7, b
#define NCO1OUT                          BANKMASK(NCO1CON), 5, b
#define NCO1PFM                          BANKMASK(NCO1CON), 0, b
#define NCO1POL                          BANKMASK(NCO1CON), 4, b
#define NCO1PWS0                         BANKMASK(NCO1CLK), 5, b
#define NCO1PWS1                         BANKMASK(NCO1CLK), 6, b
#define NCO1PWS2                         BANKMASK(NCO1CLK), 7, b
#define NDIV0                            BANKMASK(OSCCON1), 0, b
#define NDIV1                            BANKMASK(OSCCON1), 1, b
#define NDIV2                            BANKMASK(OSCCON1), 2, b
#define NDIV3                            BANKMASK(OSCCON1), 3, b
#define NEGATIVE                         BANKMASK(STATUS), 4, a
#define NOSC0                            BANKMASK(OSCCON1), 4, b
#define NOSC1                            BANKMASK(OSCCON1), 5, b
#define NOSC2                            BANKMASK(OSCCON1), 6, b
#define NOSCR                            BANKMASK(OSCCON3), 3, b
#define NOT_BOR                          BANKMASK(PCON0), 0, a
#define NOT_MEMV                         BANKMASK(PCON1), 1, a
#define NOT_POR                          BANKMASK(PCON0), 1, a
#define NOT_RI                           BANKMASK(PCON0), 2, a
#define NOT_RMCLR                        BANKMASK(PCON0), 3, a
#define NOT_RWDT                         BANKMASK(PCON0), 4, a
#define NOT_T1DONE                       BANKMASK(T1GCON), 3, a
#define NOT_T1SYNC                       BANKMASK(T1CON), 2, a
#define NOT_T3DONE                       BANKMASK(T3GCON), 3, a
#define NOT_T3SYNC                       BANKMASK(T3CON), 2, a
#define NOT_T5DONE                       BANKMASK(T5GCON), 3, a
#define NOT_T5SYNC                       BANKMASK(T5CON), 2, a
#define NOT_WDTWV                        BANKMASK(PCON0), 5, a
#define NREF0                            BANKMASK(ADREF), 4, b
#define NSS                              BANKMASK(DAC1CON0), 0, b
#define NVMADR0                          BANKMASK(NVMADRL), 0, b
#define NVMADR1                          BANKMASK(NVMADRL), 1, b
#define NVMADR2                          BANKMASK(NVMADRL), 2, b
#define NVMADR3                          BANKMASK(NVMADRL), 3, b
#define NVMADR4                          BANKMASK(NVMADRL), 4, b
#define NVMADR5                          BANKMASK(NVMADRL), 5, b
#define NVMADR6                          BANKMASK(NVMADRL), 6, b
#define NVMADR7                          BANKMASK(NVMADRL), 7, b
#define NVMADR8                          BANKMASK(NVMADRH), 0, b
#define NVMADR9                          BANKMASK(NVMADRH), 1, b
#define NVMDAT0                          BANKMASK(NVMDAT), 0, b
#define NVMDAT1                          BANKMASK(NVMDAT), 1, b
#define NVMDAT2                          BANKMASK(NVMDAT), 2, b
#define NVMDAT3                          BANKMASK(NVMDAT), 3, b
#define NVMDAT4                          BANKMASK(NVMDAT), 4, b
#define NVMDAT5                          BANKMASK(NVMDAT), 5, b
#define NVMDAT6                          BANKMASK(NVMDAT), 6, b
#define NVMDAT7                          BANKMASK(NVMDAT), 7, b
#define NVMIE                            BANKMASK(PIE0), 4, b
#define NVMIF                            BANKMASK(PIR0), 4, b
#define NVMIP                            BANKMASK(IPR0), 4, b
#define NVMMD                            BANKMASK(PMD0), 2, b
#define NVMREG0                          BANKMASK(NVMCON1), 6, b
#define NVMREG1                          BANKMASK(NVMCON1), 7, b
#define ODCA0                            BANKMASK(ODCONA), 0, b
#define ODCA1                            BANKMASK(ODCONA), 1, b
#define ODCA2                            BANKMASK(ODCONA), 2, b
#define ODCA3                            BANKMASK(ODCONA), 3, b
#define ODCA4                            BANKMASK(ODCONA), 4, b
#define ODCA5                            BANKMASK(ODCONA), 5, b
#define ODCA6                            BANKMASK(ODCONA), 6, b
#define ODCA7                            BANKMASK(ODCONA), 7, b
#define ODCB0                            BANKMASK(ODCONB), 0, b
#define ODCB1                            BANKMASK(ODCONB), 1, b
#define ODCB2                            BANKMASK(ODCONB), 2, b
#define ODCB3                            BANKMASK(ODCONB), 3, b
#define ODCB4                            BANKMASK(ODCONB), 4, b
#define ODCB5                            BANKMASK(ODCONB), 5, b
#define ODCB6                            BANKMASK(ODCONB), 6, b
#define ODCB7                            BANKMASK(ODCONB), 7, b
#define ODCC0                            BANKMASK(ODCONC), 0, b
#define ODCC1                            BANKMASK(ODCONC), 1, b
#define ODCC2                            BANKMASK(ODCONC), 2, b
#define ODCC3                            BANKMASK(ODCONC), 3, b
#define ODCC4                            BANKMASK(ODCONC), 4, b
#define ODCC5                            BANKMASK(ODCONC), 5, b
#define ODCC6                            BANKMASK(ODCONC), 6, b
#define ODCC7                            BANKMASK(ODCONC), 7, b
#define ODCD0                            BANKMASK(ODCOND), 0, b
#define ODCD1                            BANKMASK(ODCOND), 1, b
#define ODCD2                            BANKMASK(ODCOND), 2, b
#define ODCD3                            BANKMASK(ODCOND), 3, b
#define ODCD4                            BANKMASK(ODCOND), 4, b
#define ODCD5                            BANKMASK(ODCOND), 5, b
#define ODCD6                            BANKMASK(ODCOND), 6, b
#define ODCD7                            BANKMASK(ODCOND), 7, b
#define ODCE0                            BANKMASK(ODCONE), 0, b
#define ODCE1                            BANKMASK(ODCONE), 1, b
#define ODCE2                            BANKMASK(ODCONE), 2, b
#define OE1                              BANKMASK(DAC1CON0), 5, b
#define OE2                              BANKMASK(DAC1CON0), 4, b
#define OPOL                             BANKMASK(MD1CON0), 4, b
#define ORDY                             BANKMASK(OSCCON3), 4, b
#define OSFIE                            BANKMASK(PIE0), 2, b
#define OSFIF                            BANKMASK(PIR0), 2, b
#define OSFIP                            BANKMASK(IPR0), 2, b
#define OVERFLOW                         BANKMASK(STATUS), 3, a
#define P1H                              BANKMASK(U1P1H), 0, b
#define P2H                              BANKMASK(U1P2H), 0, b
#define P3H                              BANKMASK(U1P3H), 0, b
#define P5TSEL0                          BANKMASK(CCPTMRS1), 0, b
#define P5TSEL1                          BANKMASK(CCPTMRS1), 1, b
#define P6TSEL0                          BANKMASK(CCPTMRS1), 2, b
#define P6TSEL1                          BANKMASK(CCPTMRS1), 3, b
#define P7TSEL0                          BANKMASK(CCPTMRS1), 4, b
#define P7TSEL1                          BANKMASK(CCPTMRS1), 5, b
#define P8TSEL0                          BANKMASK(CCPTMRS1), 6, b
#define P8TSEL1                          BANKMASK(CCPTMRS1), 7, b
#define PC1IE                            BANKMASK(I2C1PIE), 2, b
#define PC1IF                            BANKMASK(I2C1PIR), 2, b
#define PC2IE                            BANKMASK(I2C2PIE), 2, b
#define PC2IF                            BANKMASK(I2C2PIR), 2, b
#define PCH3                             BANKMASK(ADPCH), 3, b
#define PCH4                             BANKMASK(ADPCH), 4, b
#define PCH5                             BANKMASK(ADPCH), 5, b
#define PFM                              BANKMASK(NCO1CON), 0, b
#define PLEN0                            BANKMASK(CRCCON1), 0, b
#define PLEN1                            BANKMASK(CRCCON1), 1, b
#define PLEN2                            BANKMASK(CRCCON1), 2, b
#define PLEN3                            BANKMASK(CRCCON1), 3, b
#define PLLR                             BANKMASK(OSCSTAT), 0, b
#define POR                              BANKMASK(PCON0), 1, a
#define PPOL                             BANKMASK(ADCON1), 7, b
#define PPSLOCKED                        BANKMASK(PPSLOCK), 0, b
#define PR10                             BANKMASK(SMT1PRH), 2, b
#define PR11                             BANKMASK(SMT1PRH), 3, b
#define PR12                             BANKMASK(SMT1PRH), 4, b
#define PR13                             BANKMASK(SMT1PRH), 5, b
#define PR14                             BANKMASK(SMT1PRH), 6, b
#define PR15                             BANKMASK(SMT1PRH), 7, b
#define PR16                             BANKMASK(SMT1PRU), 0, b
#define PR17                             BANKMASK(SMT1PRU), 1, b
#define PR18                             BANKMASK(SMT1PRU), 2, b
#define PR19                             BANKMASK(SMT1PRU), 3, b
#define PR20                             BANKMASK(SMT1PRU), 4, b
#define PR21                             BANKMASK(SMT1PRU), 5, b
#define PR22                             BANKMASK(SMT1PRU), 6, b
#define PR23                             BANKMASK(SMT1PRU), 7, b
#define PR3                              BANKMASK(SMT1PRL), 3, b
#define PR4                              BANKMASK(SMT1PRL), 4, b
#define PR5                              BANKMASK(SMT1PRL), 5, b
#define PR6                              BANKMASK(SMT1PRL), 6, b
#define PR7                              BANKMASK(SMT1PRL), 7, b
#define PR8                              BANKMASK(SMT1PRH), 0, b
#define PR9                              BANKMASK(SMT1PRH), 1, b
#define PRE0                             BANKMASK(ADPREL), 0, b
#define PRE1                             BANKMASK(ADPREL), 1, b
#define PRE10                            BANKMASK(ADPREH), 2, b
#define PRE11                            BANKMASK(ADPREH), 3, b
#define PRE12                            BANKMASK(ADPREH), 4, b
#define PRE2                             BANKMASK(ADPREL), 2, b
#define PRE3                             BANKMASK(ADPREL), 3, b
#define PRE4                             BANKMASK(ADPREL), 4, b
#define PRE5                             BANKMASK(ADPREL), 5, b
#define PRE6                             BANKMASK(ADPREL), 6, b
#define PRE7                             BANKMASK(ADPREL), 7, b
#define PRE8                             BANKMASK(ADPREH), 0, b
#define PRE9                             BANKMASK(ADPREH), 1, b
#define PREF0                            BANKMASK(ADREF), 0, b
#define PREF1                            BANKMASK(ADREF), 1, b
#define PREV0                            BANKMASK(ADPREVL), 0, b
#define PREV1                            BANKMASK(ADPREVL), 1, b
#define PREV10                           BANKMASK(ADPREVH), 2, b
#define PREV11                           BANKMASK(ADPREVH), 3, b
#define PREV12                           BANKMASK(ADPREVH), 4, b
#define PREV13                           BANKMASK(ADPREVH), 5, b
#define PREV14                           BANKMASK(ADPREVH), 6, b
#define PREV15                           BANKMASK(ADPREVH), 7, b
#define PREV2                            BANKMASK(ADPREVL), 2, b
#define PREV3                            BANKMASK(ADPREVL), 3, b
#define PREV4                            BANKMASK(ADPREVL), 4, b
#define PREV5                            BANKMASK(ADPREVL), 5, b
#define PREV6                            BANKMASK(ADPREVL), 6, b
#define PREV7                            BANKMASK(ADPREVL), 7, b
#define PREV8                            BANKMASK(ADPREVH), 0, b
#define PREV9                            BANKMASK(ADPREVH), 1, b
#define PRLOCKED                         BANKMASK(PRLOCK), 0, b
#define PS0                              BANKMASK(SMT1CON0), 0, b
#define PS1                              BANKMASK(SMT1CON0), 1, b
#define PSCNT0                           BANKMASK(WDTPSL), 0, b
#define PSCNT1                           BANKMASK(WDTPSL), 1, b
#define PSCNT10                          BANKMASK(WDTPSH), 2, b
#define PSCNT11                          BANKMASK(WDTPSH), 3, b
#define PSCNT12                          BANKMASK(WDTPSH), 4, b
#define PSCNT13                          BANKMASK(WDTPSH), 5, b
#define PSCNT14                          BANKMASK(WDTPSH), 6, b
#define PSCNT15                          BANKMASK(WDTPSH), 7, b
#define PSCNT16                          BANKMASK(WDTTMR), 0, b
#define PSCNT17                          BANKMASK(WDTTMR), 1, b
#define PSCNT2                           BANKMASK(WDTPSL), 2, b
#define PSCNT3                           BANKMASK(WDTPSL), 3, b
#define PSCNT4                           BANKMASK(WDTPSL), 4, b
#define PSCNT5                           BANKMASK(WDTPSL), 5, b
#define PSCNT6                           BANKMASK(WDTPSL), 6, b
#define PSCNT7                           BANKMASK(WDTPSL), 7, b
#define PSCNT8                           BANKMASK(WDTPSH), 0, b
#define PSCNT9                           BANKMASK(WDTPSH), 1, b
#define PSIS                             BANKMASK(ADCON2), 7, b
#define PSS0                             BANKMASK(DAC1CON0), 2, b
#define PSS1                             BANKMASK(DAC1CON0), 3, b
#define PWM5DC0                          BANKMASK(PWM5DCL), 6, a
#define PWM5DC1                          BANKMASK(PWM5DCL), 7, a
#define PWM5DC2                          BANKMASK(PWM5DCH), 0, a
#define PWM5DC3                          BANKMASK(PWM5DCH), 1, a
#define PWM5DC4                          BANKMASK(PWM5DCH), 2, a
#define PWM5DC5                          BANKMASK(PWM5DCH), 3, a
#define PWM5DC6                          BANKMASK(PWM5DCH), 4, a
#define PWM5DC7                          BANKMASK(PWM5DCH), 5, a
#define PWM5DC8                          BANKMASK(PWM5DCH), 6, a
#define PWM5DC9                          BANKMASK(PWM5DCH), 7, a
#define PWM5EN                           BANKMASK(PWM5CON), 7, a
#define PWM5MD                           BANKMASK(PMD3), 4, b
#define PWM5OUT                          BANKMASK(PWM5CON), 5, a
#define PWM5POL                          BANKMASK(PWM5CON), 4, a
#define PWM6DC0                          BANKMASK(PWM6DCL), 6, a
#define PWM6DC1                          BANKMASK(PWM6DCL), 7, a
#define PWM6DC2                          BANKMASK(PWM6DCH), 0, a
#define PWM6DC3                          BANKMASK(PWM6DCH), 1, a
#define PWM6DC4                          BANKMASK(PWM6DCH), 2, a
#define PWM6DC5                          BANKMASK(PWM6DCH), 3, a
#define PWM6DC6                          BANKMASK(PWM6DCH), 4, a
#define PWM6DC7                          BANKMASK(PWM6DCH), 5, a
#define PWM6DC8                          BANKMASK(PWM6DCH), 6, a
#define PWM6DC9                          BANKMASK(PWM6DCH), 7, a
#define PWM6EN                           BANKMASK(PWM6CON), 7, a
#define PWM6MD                           BANKMASK(PMD3), 5, b
